#  Mate bank є можливість покласти гроші на депозит під певний відсоток і отримати прибуток через деякий час.
# Наприклад, якщо покласти 10000 на 3 роки під 4% річних, отримаємо:
#     перший рік: 10000 + 4% = 10400 (10000 + 10000 * 0.04);
#     другий рік: 10400 + 4% = 10816 (10400 + 10400 * 0.04);
#     третій рік: 10816 + 4% = 11248.64 (10816 + 10816 * 0.04);
#     чистий прибуток: 11248.64 - 10000 = 1248.64.
# Твоє завдання: напиши функцію calculate_profit, яка приймає 3 параметри:
#     amount — початкова сума, яку ми кладемо на депозит;
#     percent — річна відсоткова ставка;
#     period — кількість років (час, на який гроші кладуться на депозит).
# Функція повинна розрахувати та повернути суму чистого прибутку за весь час.
# Зверни увагу: якщо amount, percent або period дорівнюють 0, то функція повинна повернути 0.

